<template>
    <NuxtLayout name="header">
        <template #sub-title>ข้อควรรู้</template>
        <template #title>กติกาการเข้าเล่น</template>
    </NuxtLayout>
    <v-container class="mt-n10 main-container">
        <v-row>
            <v-col cols="3" class="d-none d-lg-block">
                <SideBarTradeLeftBar/>
            </v-col>
            <v-col cols="12" lg="9">
                <v-sheet class="pa-10 rounded-xl">
                    <v-row>
                        <v-col cols="12" class="mb-2">
                            <p>กรุณาตรวจสอบรายการเล่นและ พิมพ์เก็บไว้เป็นหลักฐานเสมอ
                                หากมีข้อสงสัยในการตั้งค่าต่างๆ และต้องการความช่วยเหลือ โปรดติดต่อต้นสายของท่าน หากมีข้อผิดพลาดที่เกิดขึ้นกับระบบ
                                โปรดแจ้งทางต้นสายของท่าน ก่อนออกผลรางวัล มิเช่นนั้นบริษัท จะถือเอารายการแทงและข้อมูลที่เกิดขึ้นในเว็บไซต์เป็นหลักเสมอ
                            </p>
                        </v-col>

                        <v-col cols="12" class="mb-4">
                            <ol class="ps-10">
                                <li>
                                    กติกา การเข้าเล่น แต่ละตลาดหวย สมาชิกสามารถเข้าเล่นที่ เมนู แทงหวย<br/>
                                    <small>**สำคัญ**โปรดตรวจทานทุกครั้งก่อนกดยืนยันการแทงเพราะแทงแล้วยกเลิกไม่ได้ และทางบริษัทแนะนำให้แทงแล้ว เก็บของมูลการแทงไว้(save/print) เพื่อตรวจสอบหลังผลรางวัลออก</small>
                                </li>
                                <li>สามารถตรวจสอบรายการที่แทงแล้ว ที่ส่วนขวาของหน้าแทงหวย และ ที่เมนู รายการแทง ด้านบนของหน้าเล่น</li>
                                <li>สามารถตรวจสอบรายการที่ประกาศผลแล้ว ที่เมนู รายการการเงิน ด้านบนของหน้าเล่น</li>
                                <li>สามารถเช็คผลรางวัลแต่ละตลาดได้ที่ เมนู ตรวจผลรางวัล ด้านบนของหน้าเล่น+หากไม่มีหลักฐานมายืนยัน(ที่บันทึก/ปริ้นไว้) มายืนยัน บริษัทยึดตามข้อมูลที่บริษัทมีอยู่</li>
                                <li>หากเอเย่นต์หรือสมาชิก ท่านใดพบปัญหาการแทง หรือระบบบัญชี ในหน้าส่วนตัว โปรดติดต่อเอเย่นต์ ของท่าน ภายใน1ชม ก่อนหวยออก มิเช่นนั้นบริษัทจะยึดข้อมูลตามเว๊บไซต์เป็นหลัก</li>
                                <li>หากมีการเปลี่ยนแปลงในการออกผลรางวัลตลาดต่างๆทางบริษัท จะแจ้งลูกค้าผ่านทางข้าวสาร ‘ตัวอักษรวิ่ง’ ด้านบน, หรือ แจ้งผ่านทางเอเย่นต์ของท่าน</li>
                                <li>บริษัทแนะนำให้ เอเย่นต์และสมาชิกทุกท่าน ดูแลรับผิดชอบข้อมูลส่วนตัว และรหัสการเข้าสู่หน้าแทง ของสมาชิกภายใต้การดูแลของสายงานเป็นอย่างดี เพื่อผลประโยชน์ของทุกท่าน</li>
                                <li>บริษัทปฎิเสธการจ่ายเงินรางวัล ทั้งสายงาน และยกเลิกความเป็นสมาชิก หากตรวจพบการโกงหรือทุจรจิตร ทุกรูปแบบที่เกิดขึ้น</li>
                                <li>เอเยนต์ทุกสายงาน ต้องรับผิดชอบกับยอดที่เกิดขึ้นภายใต้สายงานตัวเองทุกกรณี และ บริษัทมีสิทธิในการยกเลิก ทุกยอดที่มีการเล่นเข้ามาหลังหวยออกแล้วของทุกตลาดหวย</li>
                            </ol>
                        </v-col>

                        <v-divider></v-divider>

                        <v-col cols="12" class="mb-4">
                            <h4>หวยไทย (หวยรัฐบาล)</h4>
                            <ul class="ps-10">
                                <li>รางวัล 3 ตัวบน จะใช้3ตัวสุดท้ายของรางวัลที่ 1 </li>
                                <li>รางวัล 2 ตัวบน จะใช้2ตัวสุดท้ายของรางวัลที่ 1</li>
                                <li>รางวัล 3 ตัวโต้ด จะใช้3ตัวสุดท้ายของรางวัลที่ 1 สลับตำแหน่งได้</li>
                                <li>รางวัล 2 ตัวโต้ด จะใช้3ตัวสุดท้ายของรางวัลที่ 1 ถูก2ตัวสลับตำแหน่งได้</li>
                                <li>รางวัล วิ่งบน จะใช้3ตัวสุดท้ายของรางวัลที่ 1 ถูก1ตัวสลับตำแหน่งได้ </li>
                                <li>รางวัล 2 ตัวล่าง จะใช้รางวัลเลขท้าย 2 ตัว</li>
                                <li>รางวัล วิ่งล่าง จะใช้รางวัลเลขท้าย 2 ตัว ถูก1ตัวสลับตำแหน่งได้ </li>
                                <li>รางวัล 3 ตัวล่าง มี 4 รางวัล ใช้รางวัลเลขท้าย 3 ตัว 2รางวัล และ รางวัลเลข 3 ตัวหน้า 2รางวัล</li>
                                <li>รางวัล คู่คี่บน จะใช้เลขหลักหน่วย ของ 2ตัวบน เลขคู่คือ 0,2,4,6,8 และคี่คือ 1,3,5,7,9</li>
                                <li>รางวัล คู่คี่ล่าง จะใช้เลขหลักหน่วย ของ 2ตัวล่าง เลขคู่คือ 0,2,4,6,8 และคี่คือ 1,3,5,7,9</li>
                                <li>รางวัล สูงต่ำบน จะใช้เลขหลักสิบ ของ 2ตัวบน ต่ำคือเลข 0,1,2,3,4 และสูงคือเลข 5,6,7,8,9</li>
                                <li>รางวัล สูงต่ำล่าง จะใช้เลขหลักสิบ ของ 2ตัวล่าง ต่ำคือเลข 0,1,2,3,4 และสูงคือเลข 5,6,7,8,9</li>
                            </ul>
                        </v-col>

                        <v-divider></v-divider>

                        <v-col cols="12" class="mb-4">
                            <h4>หวยลาว</h4>
                            <ul class="ps-10">
                                <li>รางวัล 3 ตัวบน จะใช้3ตัวสุดท้าย(จากเลข4หลักที่ออกรางวัล) </li>
                                <li>รางวัล 2 ตัวบน จะใช้2ตัวสุดท้าย(จากเลข4หลักที่ออกรางวัล) </li>
                                <li>รางวัล 3 ตัวโต้ด จะใช้3ตัวสุดท้าย(จากเลข4หลักที่ออกรางวัล) สลับตำแหน่งได้</li>
                                <li>รางวัล 2 ตัวโต้ด จะใช้3ตัวสุดท้าย(จากเลข4หลักที่ออกรางวัล) ถูก2ตัวสลับตำแหน่งได้</li>
                                <li>รางวัล วิ่งบน จะใช้3ตัวสุดท้าย(จากเลข4หลักที่ออกรางวัล) ถูก1ตัวสลับตำแหน่งได้ </li>
                                <li>รางวัล 2 ตัวล่าง จะใช้2ตัวเลขด้านหน้า(จากเลข4หลักที่ออกรางวัล) </li>
                                <li>รางวัล คู่คี่บน จะใช้เลขหลักหน่วย ของ 2ตัวบน เลขคู่คือ 0,2,4,6,8 และคี่คือ 1,3,5,7,9</li>
                                <li>รางวัล คู่คี่ล่าง จะใช้เลขหลักหน่วย ของ 2ตัวล่าง เลขคู่คือ 0,2,4,6,8 และคี่คือ 1,3,5,7,9</li>
                                <li>รางวัล สูงต่ำบน จะใช้เลขหลักสิบ ของ 2ตัวบน ต่ำคือเลข 0,1,2,3,4 และสูงคือเลข 5,6,7,8,9</li>
                                <li>รางวัล สูงต่ำล่าง จะใช้เลขหลักสิบ ของ 2ตัวล่าง ต่ำคือเลข 0,1,2,3,4 และสูงคือเลข 5,6,7,8,9</li>
                            </ul>
                        </v-col>

                        <v-divider></v-divider>

                        <v-col cols="12" class="mb-4">
                            <h4>หวยเวียดนาม (หวยฮานอย)</h4>
                            <ul class="ps-10">
                                <li>รางวัล 3 ตัวบน จะใช้3ตัวสุดท้ายของรางวัลที่ 1 </li>
                                <li>รางวัล 2 ตัวบน จะใช้2ตัวสุดท้ายของรางวัลที่ 1</li>
                                <li>รางวัล 3 ตัวโต้ด จะใช้3ตัวสุดท้ายของรางวัลที่ 1 สลับตำแหน่งได้</li>
                                <li>รางวัล 2 ตัวโต้ด จะใช้3ตัวสุดท้ายของรางวัลที่ 1 ถูก2ตัวสลับตำแหน่งได้</li>
                                <li>รางวัล วิ่งบน จะใช้3ตัวสุดท้ายของรางวัลที่ 1 ถูก1ตัวสลับตำแหน่งได้</li> 
                                <li>รางวัล 2 ตัวล่าง จะใช้2ตัวสุดท้ายของรางวัลที่ 2</li>
                                <li>รางวัล วิ่งล่าง จะใช้รางวัลเลขท้าย 2 ตัวของรางวัลที่ 2 ถูก1ตัวสลับตำแหน่งได้ </li>
                                <li>รางวัล 3 ตัวล่าง จะใช้3ตัวสุดท้ายของรางวัลที่ 2</li>
                                <li>รางวัล คู่คี่บน จะใช้เลขหลักหน่วย ของ 2ตัวบน เลขคู่คือ 0,2,4,6,8 และคี่คือ 1,3,5,7,9</li>
                                <li>รางวัล คู่คี่ล่าง จะใช้เลขหลักหน่วย ของ 2ตัวล่าง เลขคู่คือ 0,2,4,6,8 และคี่คือ 1,3,5,7,9</li>
                                <li>รางวัล สูงต่ำบน จะใช้เลขหลักสิบ ของ 2ตัวบน ต่ำคือเลข 0,1,2,3,4 และสูงคือเลข 5,6,7,8,9</li>
                                <li>รางวัล สูงต่ำล่าง จะใช้เลขหลักสิบ ของ 2ตัวล่าง ต่ำคือเลข 0,1,2,3,4 และสูงคือเลข 5,6,7,8,9</li>
                            </ul>
                        </v-col>

                        <v-divider></v-divider>
                        
                        <v-col cols="12" class="mb-4">
                            <h4>หวยมาเลเซีย</h4>
                            <ul class="ps-10">
                                <li>รางวัล 3 ตัวบน จะใช้3ตัวสุดท้ายของรางวัลที่ 1 </li>
                                <li>รางวัล 2 ตัวบน จะใช้2ตัวสุดท้ายของรางวัลที่ 1</li>
                                <li>รางวัล 3 ตัวโต้ด จะใช้3ตัวสุดท้ายของรางวัลที่ 1 สลับตำแหน่งได้</li>
                                <li>รางวัล 2 ตัวโต้ด จะใช้3ตัวสุดท้ายของรางวัลที่ 1 ถูก2ตัวสลับตำแหน่งได้</li>
                                <li>รางวัล วิ่งบน จะใช้3ตัวสุดท้ายของรางวัลที่ 1 ถูก1ตัวสลับตำแหน่งได้ </li>
                                <li>รางวัล 2 ตัวล่าง จะใช้2ตัวสุดท้ายของรางวัลที่ 2</li>
                                <li>รางวัล วิ่งล่าง จะใช้รางวัลเลขท้าย 2 ตัวของรางวัลที่ 2 ถูก1ตัวสลับตำแหน่งได้ </li>
                                <li>รางวัล 3 ตัวล่าง จะใช้3ตัวสุดท้ายของรางวัลที่ 2</li>
                                <li>รางวัล คู่คี่บน จะใช้เลขหลักหน่วย ของ 2ตัวบน เลขคู่คือ 0,2,4,6,8 และคี่คือ 1,3,5,7,9</li>
                                <li>รางวัล คู่คี่ล่าง จะใช้เลขหลักหน่วย ของ 2ตัวล่าง เลขคู่คือ 0,2,4,6,8 และคี่คือ 1,3,5,7,9</li>
                                <li>รางวัล สูงต่ำบน จะใช้เลขหลักสิบ ของ 2ตัวบน ต่ำคือเลข 0,1,2,3,4 และสูงคือเลข 5,6,7,8,9</li>
                                <li>รางวัล สูงต่ำล่าง จะใช้เลขหลักสิบ ของ 2ตัวล่าง ต่ำคือเลข 0,1,2,3,4 และสูงคือเลข 5,6,7,8,9</li>
                            </ul>
                        </v-col>
                    </v-row>
                </v-sheet>
            </v-col>
        </v-row>
    </v-container>
</template>

<script setup>
definePageMeta({
    middleware: 'auth'
})
</script>